# Задайте список из n чисел последовательности (1+1/n)^n и выведите на экран их сумму.
# 
# Пример:
# 
# - Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}

n = int(input('Введите число N: '))
count = 0
m = 0
b = 0
while (n>count):
    count = count + 1
    m = (1+1/count)**count
    b = b + m
    print (f'{round (b, 2)}   ', end = '')